| Comment: Mimikatz LSASS Memory Access | T1003.001 | Author: Chandra Sekhar Chakraborty

index=windows source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=10
TargetImage="*\\lsass.exe"
(GrantedAccess="0x1010" OR GrantedAccess="0x1410" OR GrantedAccess="0x147a" OR GrantedAccess="0x1418" OR GrantedAccess="0x1fffff")
NOT SourceImage IN ("*\\MsMpEng.exe", "*\\WmiPrvSE.exe", "*\\lsm.exe")
| table _time, ComputerName, SourceImage, TargetImage, GrantedAccess, CallTrace
| sort -_time
