// Rule: Mimikatz LSASS Memory Access
// Tactic: Credential Access | Technique: T1003.001
// Author: Chandra Sekhar Chakraborty
// Description: Detects suspicious access to LSASS process memory via Sysmon Event 10

process where event.type == "start" and
  process.name == "lsass.exe" and
  /* Suspicious granted access masks used by Mimikatz */
  winlog.event_data.GrantedAccess in (
    "0x1010", "0x1410", "0x147a", "0x1418",
    "0x1fffff", "0x1f3fff", "0x143a"
  ) and
  not process.parent.executable in (
    "C:\\Program Files\\Windows Defender\\MsMpEng.exe",
    "C:\\Windows\\System32\\wbem\\WmiPrvSE.exe",
    "C:\\Windows\\System32\\lsm.exe"
  )
